%%该程序用于作图：描述四元数作用于物体的动态变化过程
clc;
clear all;
%% 导入初始四元数
A=xlsread('curvepoint');% 导入数据
[n1 n2]=size(A);
q=zerosq(n1,1);
for i=1:n1
    q(i,1)=coord2qua(A(i,:));
end
%% 物体顶点坐标
t=zerosq(8,1);
t(1,1)=quaternion(0,1,-1,1);
t(2,1)=quaternion(0,-1,-1,1);
t(3,1)=quaternion(0,-1,1,1);
t(4,1)=quaternion(0,1,1,1);
t(5,1)=quaternion(0,1,1,-1);
t(6,1)=quaternion(0,1,-1,-1);
t(7,1)=quaternion(0,-1,-1,-1);
t(8,1)=quaternion(0,-1,1,-1);
t1=t;
%% 将顶点四元数转换成三维坐标
T=zeros(8,3);
for i=1:8
    T(i,:)=qua2coord1(t(i,1));
end
%% 保存面顶点
m1=zeros(4,3);
m2=m1;
m3=m1;
m4=m1;
m5=m1;
m6=m1;
m1(1,:)=T(2,:);
m1(2,:)=T(3,:);
m1(3,:)=T(4,:);
m1(4,:)=T(1,:);
m2(1,:)=T(2,:);
m2(2,:)=T(3,:);
m2(3,:)=T(8,:);
m2(4,:)=T(7,:);
m3(1,:)=T(2,:);
m3(2,:)=T(1,:);
m3(3,:)=T(6,:);
m3(4,:)=T(7,:);
m4(1,:)=T(4,:);
m4(2,:)=T(3,:);
m4(3,:)=T(8,:);
m4(4,:)=T(5,:);
m5(1,:)=T(6,:);
m5(2,:)=T(7,:);
m5(3,:)=T(8,:);
m5(4,:)=T(5,:);
m6(1,:)=T(1,:);
m6(2,:)=T(4,:);
m6(3,:)=T(5,:);
m6(4,:)=T(6,:);
xx=[m1(:,1),m2(:,1),m3(:,1),m4(:,1),m5(:,1),m6(:,1)];
yy=[m1(:,2),m2(:,2),m3(:,2),m4(:,2),m5(:,2),m6(:,2)];
zz=[m1(:,3),m2(:,3),m3(:,3),m4(:,3),m5(:,3),m6(:,3)];
%% 旋转变换并作图
B=zerosq(n1,1);
for i=1:n1
    B(i,1)=coord2qua(A(i,:));
end
%fill3(xx,yy,zz,'r');
grid on
drawnow;
pause(0.1);
for i=1:n1
    for j=1:8
        t(j,1)=B(i,1)*t(j,1)*conj(B(i,1));
    end
    for i=1:8
        T(i,:)=qua2coord1(t(i,1));
    end
    m1=zeros(4,3);
    m2=m1;
    m3=m1;
    m4=m1;
    m5=m1;
    m6=m1;
    m1(1,:)=T(2,:);
    m1(2,:)=T(3,:);
    m1(3,:)=T(4,:);
    m1(4,:)=T(1,:);
    m2(1,:)=T(2,:);
    m2(2,:)=T(3,:);
    m2(3,:)=T(8,:);
    m2(4,:)=T(7,:);
    m3(1,:)=T(2,:);
    m3(2,:)=T(1,:);
    m3(3,:)=T(6,:);
    m3(4,:)=T(7,:); 
    m4(1,:)=T(4,:);
    m4(2,:)=T(3,:);
    m4(3,:)=T(8,:);
    m4(4,:)=T(5,:);
    m5(1,:)=T(6,:);
    m5(2,:)=T(7,:);
    m5(3,:)=T(8,:);
    m5(4,:)=T(5,:);
    m6(1,:)=T(1,:);
    m6(2,:)=T(4,:);
    m6(3,:)=T(5,:);
    m6(4,:)=T(6,:);
    xx=[m1(:,1),m2(:,1),m3(:,1),m4(:,1),m5(:,1),m6(:,1)];
    yy=[m1(:,2),m2(:,2),m3(:,2),m4(:,2),m5(:,2),m6(:,2)];
    zz=[m1(:,3),m2(:,3),m3(:,3),m4(:,3),m5(:,3),m6(:,3)];
    clf
    fill3(xx(:,1),yy(:,1),zz(:,1),'y');
    hold on
     fill3([xx(:,2),xx(:,6)],[yy(:,2),yy(:,6)],[zz(:,2),zz(:,6)],'b');
     hold on
    fill3([xx(:,3),xx(:,4)],[yy(:,3),yy(:,4)],[zz(:,3),zz(:,4)],'r');
    hold on
     fill3(xx(:,5),yy(:,5),zz(:,5),'g');
     hold on
     axis([-2 2 -2 2 -2 2])
    %fill3(xx,yy,zz,'r');
    grid on
    drawnow;
    pause(0.01);
    t=t1;
end
xlabel('x轴')
ylabel('y轴')
zlabel('z轴')